app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies`
---
  def index
    @movies = Movie.all

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
    def set_movie
      @movie = Movie.find(params[:id])